print("""
░█████╗░░█████╗░██╗░░░░░░█████╗░██╗░░░██╗██╗░░░░░░█████╗░██████╗░░█████╗░██████╗░░█████╗░  ██████╗░███████╗
██╔══██╗██╔══██╗██║░░░░░██╔══██╗██║░░░██║██║░░░░░██╔══██╗██╔══██╗██╔══██╗██╔══██╗██╔══██╗  ██╔══██╗██╔════╝
██║░░╚═╝███████║██║░░░░░██║░░╚═╝██║░░░██║██║░░░░░███████║██║░░██║██║░░██║██████╔╝███████║  ██║░░██║█████╗░░
██║░░██╗██╔══██║██║░░░░░██║░░██╗██║░░░██║██║░░░░░██╔══██║██║░░██║██║░░██║██╔══██╗██╔══██║  ██║░░██║██╔══╝░░
╚█████╔╝██║░░██║███████╗╚█████╔╝╚██████╔╝███████╗██║░░██║██████╔╝╚█████╔╝██║░░██║██║░░██║  ██████╔╝███████╗
░╚════╝░╚═╝░░╚═╝╚══════╝░╚════╝░░╚═════╝░╚══════╝╚═╝░░╚═╝╚═════╝░░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝  ╚═════╝░╚══════╝

██╗███╗░░░███╗░█████╗░
██║████╗░████║██╔══██╗
██║██╔████╔██║██║░░╚═╝
██║██║╚██╔╝██║██║░░██╗
██║██║░╚═╝░██║╚█████╔╝
╚═╝╚═╝░░░░░╚═╝░╚════╝░""")


nome1 = input('Digite o seu nome: ')
nome2 = input(f'Olá {nome1}')
idade = input('Digite sua idade: ')
peso = float(input("Digite o seu peso (ex: 60):  "))
altura = float(input('Digite sua altura (ex: 1.70): '))

print(f'Olá {nome1}, você tem {idade} anos, seu peso é: {peso}, sua altura é: {altura}\n')

print("""
░█▀▀█ ─█▀▀█ ░█─── ░█▀▀█ ░█─░█ ░█─── ─█▀▀█ ░█▄─░█ ░█▀▀▄ ░█▀▀▀█ 　 ░█▀▀▀█ 　 ░█▀▀▀█ ░█▀▀▀ ░█─░█ 　 ▀█▀ ░█▀▄▀█ ░█▀▀█ ─ ─ ─ 
░█─── ░█▄▄█ ░█─── ░█─── ░█─░█ ░█─── ░█▄▄█ ░█░█░█ ░█─░█ ░█──░█ 　 ░█──░█ 　 ─▀▀▀▄▄ ░█▀▀▀ ░█─░█ 　 ░█─ ░█░█░█ ░█─── ▄ ▄ ▄ 
░█▄▄█ ░█─░█ ░█▄▄█ ░█▄▄█ ─▀▄▄▀ ░█▄▄█ ░█─░█ ░█──▀█ ░█▄▄▀ ░█▄▄▄█ 　 ░█▄▄▄█ 　 ░█▄▄▄█ ░█▄▄▄ ─▀▄▄▀ 　 ▄█▄ ░█──░█ ░█▄▄█ █ █ █\n""")


imc = peso / (altura * altura)
print(f'{nome1} Seu IMC é: *{imc:.2f}*')

if imc < 16:
    print('Seu estado é de Magreza grave!\n')
elif imc < 17:
    print('Seu estado é de Magreza moderada!\n')
elif imc < 18.5:
    print('Seu estado é de Magreza Leve!')
elif imc < 25:
    print('Você está super Saúdavel! Parabéns.')
elif imc < 30:
    print("Seu estado é de Sobrepeso!")
elif imc < 35:
    print('Seu estado é de Obesidade Grau I!')
elif imc < 40:
    print('Seu estado é de Obesidade Grau II! (Severa)')
else:
    print('Seu estado é de Obesidade Grau III! (Mórbida)')
